## Pandas 학습

### 라이브러리 추가

```python
!pip install pandas
```

In [9]:
!pip install pandas

Requirement already satisfied: pandas in c:\dev\python312\lib\site-packages (2.2.1)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\dev\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\dev\python312\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\dev\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\dev\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\dev\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

### Pandas 라이브러리 로딩
```python
import pandas as pd
```

### Pandas 기본
#### DataFrame 객체
- 파이썬 2차원 리스트(배열)와 동일
- 행(row) 각 하나의 유니크 데이터 묶음
- 열(column) 유니크 데이터의 하나하나 특성

In [10]:
import pandas as pd

In [11]:
## 2차원 딕셔너리 생성
data = {'이름':['ㅇㅇㅇ','ㅁㅁㅁ'], '나이':[24,25], '주소':['ㅇㅇ','ㅁㅁ'], '이메일':['ㅇㅇ','ㅁㅁ'], '결혼':[True,False]}
df = pd.DataFrame(data=data)
df

    이름  나이  주소 이메일     결혼
0  ㅇㅇㅇ  24  ㅇㅇ  ㅇㅇ   True
1  ㅁㅁㅁ  25  ㅁㅁ  ㅁㅁ  False

In [12]:
## 2차원 리스트 생성
data = [['ㅇㅇㅇ', 20, 'ㅁㅁ', 'ㅇㅇㅇ@naver.com', True], ['ㅂㅂㅂ', 30, 'ㅋㅋ', 'ㅂㅂㅂ@naver.com', False],
        ['ㅅㅅㅅ', 20, 'ㄱㄱ', 'ㅅㅅㅅ@naver.com', True], ['ㄷㄷㄷ', 25, 'ㄹㄹ', 'ㄷㄷㄷ@naver.com', False]]

data

[['ㅇㅇㅇ', 20, 'ㅁㅁ', 'ㅇㅇㅇ@naver.com', True],
 ['ㅂㅂㅂ', 30, 'ㅋㅋ', 'ㅂㅂㅂ@naver.com', False],
 ['ㅅㅅㅅ', 20, 'ㄱㄱ', 'ㅅㅅㅅ@naver.com', True],
 ['ㄷㄷㄷ', 25, 'ㄹㄹ', 'ㄷㄷㄷ@naver.com', False]]

In [13]:
## 2차원 리스트로 DataFrame 객체 생성
df = pd.DataFrame(data=data, columns=['이름', '나이', '주소', '이메일', '결혼'])
df

    이름  나이  주소            이메일     결혼
0  ㅇㅇㅇ  20  ㅁㅁ  ㅇㅇㅇ@naver.com   True
1  ㅂㅂㅂ  30  ㅋㅋ  ㅂㅂㅂ@naver.com  False
2  ㅅㅅㅅ  20  ㄱㄱ  ㅅㅅㅅ@naver.com   True
3  ㄷㄷㄷ  25  ㄹㄹ  ㄷㄷㄷ@naver.com  False

In [14]:
## 데이터프레임에서 데이터 조회(열) - 리스트는 for문을 써야 출력가능
df['이름']

0    ㅇㅇㅇ
1    ㅂㅂㅂ
2    ㅅㅅㅅ
3    ㄷㄷㄷ
Name: 이름, dtype: object

In [15]:
## 데이터프레임 조회 (2개 열)
df[['이름','나이']]

    이름  나이
0  ㅇㅇㅇ  20
1  ㅂㅂㅂ  30
2  ㅅㅅㅅ  20
3  ㄷㄷㄷ  25

In [16]:
## 데이터프레임 행으로 조회
df.loc[0]

이름               ㅇㅇㅇ
나이                20
주소                ㅁㅁ
이메일    ㅇㅇㅇ@naver.com
결혼              True
Name: 0, dtype: object

In [17]:
## 데이터프레임 조회(행)
df.loc[[1, 3]]

    이름  나이  주소            이메일     결혼
1  ㅂㅂㅂ  30  ㅋㅋ  ㅂㅂㅂ@naver.com  False
3  ㄷㄷㄷ  25  ㄹㄹ  ㄷㄷㄷ@naver.com  False

In [18]:
# 현재 데이터프레임 확인
df

    이름  나이  주소            이메일     결혼
0  ㅇㅇㅇ  20  ㅁㅁ  ㅇㅇㅇ@naver.com   True
1  ㅂㅂㅂ  30  ㅋㅋ  ㅂㅂㅂ@naver.com  False
2  ㅅㅅㅅ  20  ㄱㄱ  ㅅㅅㅅ@naver.com   True
3  ㄷㄷㄷ  25  ㄹㄹ  ㄷㄷㄷ@naver.com  False

In [19]:
## 새 컬럼 추가
df['전번'] = ['010', '02', '011', '051']

In [20]:
# 추가 데이터프레임 확인
df

    이름  나이  주소            이메일     결혼   전번
0  ㅇㅇㅇ  20  ㅁㅁ  ㅇㅇㅇ@naver.com   True  010
1  ㅂㅂㅂ  30  ㅋㅋ  ㅂㅂㅂ@naver.com  False   02
2  ㅅㅅㅅ  20  ㄱㄱ  ㅅㅅㅅ@naver.com   True  011
3  ㄷㄷㄷ  25  ㄹㄹ  ㄷㄷㄷ@naver.com  False  051

In [21]:
## 열 삭제, axis=0(행), 1(열)
df.drop('결혼', axis=1)

    이름  나이  주소            이메일   전번
0  ㅇㅇㅇ  20  ㅁㅁ  ㅇㅇㅇ@naver.com  010
1  ㅂㅂㅂ  30  ㅋㅋ  ㅂㅂㅂ@naver.com   02
2  ㅅㅅㅅ  20  ㄱㄱ  ㅅㅅㅅ@naver.com  011
3  ㄷㄷㄷ  25  ㄹㄹ  ㄷㄷㄷ@naver.com  051

In [22]:
## drop()은 삭제하고 출력만 해줌. 완전히 삭제하려면 inplace 옵션을 사용
# inplace를 화면에 출력안됨
df.drop('결혼', axis=1, inplace=True)

In [23]:
# 삭제확인
df

    이름  나이  주소            이메일   전번
0  ㅇㅇㅇ  20  ㅁㅁ  ㅇㅇㅇ@naver.com  010
1  ㅂㅂㅂ  30  ㅋㅋ  ㅂㅂㅂ@naver.com   02
2  ㅅㅅㅅ  20  ㄱㄱ  ㅅㅅㅅ@naver.com  011
3  ㄷㄷㄷ  25  ㄹㄹ  ㄷㄷㄷ@naver.com  051

In [24]:
## 행 추가
df.loc[4] = ['손흥민', 32, '런던', 'shm@gmail.com', '020']

In [25]:
df

    이름  나이  주소            이메일   전번
0  ㅇㅇㅇ  20  ㅁㅁ  ㅇㅇㅇ@naver.com  010
1  ㅂㅂㅂ  30  ㅋㅋ  ㅂㅂㅂ@naver.com   02
2  ㅅㅅㅅ  20  ㄱㄱ  ㅅㅅㅅ@naver.com  011
3  ㄷㄷㄷ  25  ㄹㄹ  ㄷㄷㄷ@naver.com  051
4  손흥민  32  런던  shm@gmail.com  020

In [26]:
## 행 삭제할 때, 완전히 지우려면 inplace를 쓰거나 변수에 재할당
df2 = df.drop(3)

In [27]:
df2

    이름  나이  주소            이메일   전번
0  ㅇㅇㅇ  20  ㅁㅁ  ㅇㅇㅇ@naver.com  010
1  ㅂㅂㅂ  30  ㅋㅋ  ㅂㅂㅂ@naver.com   02
2  ㅅㅅㅅ  20  ㄱㄱ  ㅅㅅㅅ@naver.com  011
4  손흥민  32  런던  shm@gmail.com  020

In [28]:
## 행 삭제 = inplace, 행 삭제 시는 axis=0만 사용 또는 생략
df.drop(2, axis=0, inplace=True)

In [29]:
df

    이름  나이  주소            이메일   전번
0  ㅇㅇㅇ  20  ㅁㅁ  ㅇㅇㅇ@naver.com  010
1  ㅂㅂㅂ  30  ㅋㅋ  ㅂㅂㅂ@naver.com   02
3  ㄷㄷㄷ  25  ㄹㄹ  ㄷㄷㄷ@naver.com  051
4  손흥민  32  런던  shm@gmail.com  020

In [30]:
## 열 이름을 변경
df.rename(columns={'전번':'휴대폰'}, inplace=True)

In [31]:
df

    이름  나이  주소            이메일  휴대폰
0  ㅇㅇㅇ  20  ㅁㅁ  ㅇㅇㅇ@naver.com  010
1  ㅂㅂㅂ  30  ㅋㅋ  ㅂㅂㅂ@naver.com   02
3  ㄷㄷㄷ  25  ㄹㄹ  ㄷㄷㄷ@naver.com  051
4  손흥민  32  런던  shm@gmail.com  020

- 데이터프레임은 파이썬의 2차원 리스트와 동일하지만, 좀더 사용하기 쉽게 만든 클래스

#### 시리즈 객체

- 파이썬에서 1차원 리스트(배열)
- 시리즈들 그루핑한게 데이터프레임
- 가장 최소단위

In [32]:
data = [20, 30, 20, 25, 32]
srs = pd.Series(data=data)
srs

0    20
1    30
2    20
3    25
4    32
dtype: int64

In [33]:
type(srs)

pandas.core.series.Series

In [34]:
srs = pd.Series(data=data, index=['ㅇㅇㅇ','ㅂㅂㅂ','ㅅㅅㅅ','ㄷㄷㄷ','손흥민'])
srs

ㅇㅇㅇ    20
ㅂㅂㅂ    30
ㅅㅅㅅ    20
ㄷㄷㄷ    25
손흥민    32
dtype: int64

In [35]:
## 조회
srs['손흥민']

32

In [36]:
## 값 변경
srs['ㅇㅇㅇ'] = 18

In [37]:
srs

ㅇㅇㅇ    18
ㅂㅂㅂ    30
ㅅㅅㅅ    20
ㄷㄷㄷ    25
손흥민    32
dtype: int64

In [38]:
## 데이터프레임에서 한 행을 가져와도 시리즈
df.loc[1]

이름               ㅂㅂㅂ
나이                30
주소                ㅋㅋ
이메일    ㅂㅂㅂ@naver.com
휴대폰               02
Name: 1, dtype: object

#### 데이터프레임 사용하기

- CSV, 엑셀파일 로드
- VS Code 플러그인, GrapeCity의 Excel Viewer를 설치

In [44]:
## CSV 로드
df_csv = pd.read_csv('./data/sample_1.csv', encoding='utf-8', header=1, skipfooter=2, engine='python' ,usecols=[0,1,2])
df_csv

C:\Users\Administrator\AppData\Local\Temp\ipykernel_12028\1466640592.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  df_csv = pd.read_csv('./data/sample_1.csv', encoding='utf-8', header=1, skipfooter=2)

  국적코드  성별    입국객수    전년동기
0  A01  남성  106320   85815
1  A01  여성  191436  125241
2  A31  남성     319     299
3  A31  여성      42      54
4  A18  남성  158912  124486
5  A18  여성  232943  163466

In [ ]:
!pip install openpyxl

In [45]:
# 엑셀 로드
df_xls = pd.read_excel('./data/sample_1.xlsx', header=1, skipfooter=2, usecols='A:C', sheet_name='Sheet1')
df_xls

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943